Revit 2026 API

# AnalysisDisplayColoredSurfaceSettingsTransparency Property

---

Transparency percentage of colored surface

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Transparency { get; set; }
```
```vb
Public Property Transparency As Integer
	Get
	Set
```
```cpp
public:
property int Transparency {
	int get ();
	void set (int value);
}
```
```fsharp
member Transparency : int with get, set
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| ArgumentsInconsistentException | When setting this property: transparency is less than 0 or greater than 100 |

#### Reference

AnalysisDisplayColoredSurfaceSettings Class

Autodesk.Revit.DB.Analysis Namespace